In [2]:
# File name: Exercise 4.9 - Cleaning and Merging Customer DF with Orders/Products DF
# Author: Sam Abrams
# Created: 11/7/24
# Description: This notebook contains cleaning and wrangling steps for the customer dataframe, as well as the merging of the customer dataframe with the existing orders/products dataframe.

## Importing Libraries and Data

In [3]:
#import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [4]:
# import customer dataframe
df_cust = pd.read_csv('/Users/samabrams/Data Analysis Projects/Instacart Basket Analysis/02 Data/Original Data/customers.csv')

## Exploratory Checks on Customers Dataframe

In [6]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
df_cust.tail()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

In [8]:
df_cust.shape

(206209, 10)

In [9]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [10]:
df_cust['fam_status'].value_counts(dropna = False)

fam_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [11]:
df_cust['Gender'].value_counts(dropna = False)

Gender
Male      104067
Female    102142
Name: count, dtype: int64

In [12]:
df_cust['STATE'].value_counts(dropna = False)

STATE
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

In [13]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

Missing some first names...

In [15]:
df_cust['First Name'].value_counts(dropna = False)

First Name
NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: count, Length: 208, dtype: int64

In [16]:
df_cust.isnull().sum()

user_id             0
First Name      11259
Surnam              0
Gender              0
STATE               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [17]:
# Creating dataframe with only missing first name values
df_cust_nulls = df_cust[df_cust['First Name'].isnull()]

In [18]:
df_cust_nulls.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819

In [19]:
df_cust_nulls.describe()

             user_id           Age  n_dependants         income
count   11259.000000  11259.000000  11259.000000   11259.000000
mean   102498.714895     49.336797      1.503686   94079.482192
std     59524.324166     18.557772      1.126664   42411.625779
min        61.000000     18.000000      0.000000   25937.000000
25%     50645.500000     33.000000      0.000000   58899.500000
50%    103345.000000     49.000000      2.000000   92983.000000
75%    154024.500000     65.000000      3.000000  123968.500000
max    206204.000000     81.000000      3.000000  592409.000000

In [20]:
df_cust_nulls.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11259 entries, 53 to 206171
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   user_id       11259 non-null  int64
 1   First Name    0 non-null      object
 2   Surnam        11259 non-null  object
 3   Gender        11259 non-null  object
 4   STATE         11259 non-null  object
 5   Age           11259 non-null  int64
 6   date_joined   11259 non-null  object
 7   n_dependants  11259 non-null  int64
 8   fam_status    11259 non-null  object
 9   income        11259 non-null  int64
dtypes: int64(4), object(6)
memory usage: 967.6+ KB

Since the first names are missing but not any of their information, I feel like it's safe to keep the records in the database. The first names aren't being used in the analysis unless the stakeholders want to establish a loyalty program, but there's no mention of that in the project brief. The household data and income levels can still be used for each user.

In [22]:
## Checking for Duplicates
df_cust.duplicated().sum()

0

In [23]:
## Checking for data types
df_cust.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [24]:
## Convert first name to string
df_cust['First Name'] = df_cust['First Name'].astype('str')

In [25]:
## Convert surname to string
df_cust['Surnam'] = df_cust['Surnam'].astype('str')

In [26]:
## Convert Gender to string
df_cust['Gender'] = df_cust['Gender'].astype('str')

In [27]:
## Convert State to string
df_cust['STATE'] = df_cust['STATE'].astype('str')

In [28]:
## Convert family status to string
df_cust['fam_status'] = df_cust['fam_status'].astype('str')

In [29]:
## Checking for mixed type data
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

## Renaming Columns

In [31]:
df_cust.rename(columns={'First Name':'first_name'}, inplace=True)

In [32]:
df_cust.rename(columns={'Surnam':'last_name'}, inplace=True)

In [33]:
df_cust.rename(columns={'STATE':'state'}, inplace=True)

In [34]:
df_cust.rename(columns={'n_dependants':'num_dependents'}, inplace=True)

In [35]:
df_cust.head()

,user_id,first_name,last_name,Gender,state,Age,date_joined,num_dependents,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [36]:
df_cust.shape

(206209, 10)

## Joining customer dataframe to orders/products dataframe

In [38]:
## Uploading ord_prod dataframe
df_ord_prod = pd.read_pickle('/Users/samabrams/Data Analysis Projects/Instacart Basket Analysis/02 Data/Prepared Data/orders_products_merged_flagged.pkl')

In [39]:
df_ord_prod.dtypes

product_id                  int64
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
order_id                    int64
user_id                     int64
order_number                int64
order_day_of_week           int64
order_hour_of_day           int64
days_since_last_order     float64
add_to_cart_order           int64
reordered                   int64
_merge                   category
source                   category
price_range                object
price_range_loc            object
busiest days               object
busiest day                object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
average_price             float64
spending_flag              object
median_order_freq         float64
freq_flag                  object
dtype: object

In [43]:
df_ord_prod.shape

(32404859, 26)

In [40]:
# Merging customer and orders/products page
df_ord_prod_cust = df_ord_prod.merge(df_cust, on = 'user_id')

In [41]:
df_ord_prod_cust.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,...,freq_flag,first_name,last_name,Gender,state,Age,date_joined,num_dependents,fam_status,income
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,frequent customer,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,frequent customer,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,frequent customer,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308

In [45]:
df_ord_prod_cust.shape

(32404859, 35)

In [42]:
# Exporting orders/products/customers dataframe as a pickle
df_ord_prod_cust.to_pickle('/Users/samabrams/Data Analysis Projects/Instacart Basket Analysis/02 Data/Prepared Data/ALL_order_prod_cust_dataframe.pkl')

KeyboardInterrupt

In [ ]:
df_ord_prod_cust.to_csv('/Users/samabrams/Data Analysis Projects/Instacart Basket Analysis/02 Data/Prepared Data/ALL_order_product_customer_data.csv', index=False)